knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>DSI_PCTLR</name>
            <displayName>DSI_PCTLR</displayName>
            <description>DSI Host PHY control register </description>
            <addressOffset>0xa0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DEN</name>
                <description>Digital enable
When set to 0, this bit places the digital section of the D-PHY in the reset state</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>The digital section of the D-PHY is in the reset state.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>The digital section of the D-PHY is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CKE</name>
                <description>Clock enable
This bit enables the D-PHY clock lane module:</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>D-PHY clock lane module is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>D-PHY clock lane module is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_PCONFR</name>
            <displayName>DSI_PCONFR</displayName>
            <description>DSI Host PHY configuration register </description>
            <addressOffset>0xa4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NL</name>
                <description>Number of lanes
This field configures the number of active data lanes:
Others: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>One data lane (lane 0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Two data lanes (lanes 0 and 1) - Reset value</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SW_TIME</name>
                <description>Stop wait time
This field configures the minimum wait period to request a high-speed transmission after the Stop state.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_PUCR</name>
            <displayName>DSI_PUCR</displayName>
            <description>DSI Host PHY ULPS control register </description>
            <addressOffset>0xa8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>URCL</name>
                <description>ULPS request on clock lane
ULPS mode request on clock lane.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No ULPS request</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Request ULPS mode on clock lane</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UECL</name>
                <description>ULPS exit on clock lane
ULPS mode exit on clock lane.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No exit request</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Exit ULPS mode on clock lane</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>URDL</name>
                <description>ULPS request on data lane
ULPS mode request on all active data lanes.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No ULPS request</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Request ULPS mode on all active data lane UECL</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UEDL</name>
                <description>ULPS exit on data lane
ULPS mode exit on all active data lanes.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No exit request</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Exit ULPS mode on all active data lane URDL</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_PTTCR</name>
            <displayName>DSI_PTTCR</displayName>
            <description>DSI Host PHY TX triggers configuration register </description>
            <addressOffset>0xac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TX_TRIG</name>
                <description>Transmission trigger
Escape mode transmit trigger 0-3.
Only one bit of TX_TRIG is asserted at any given time.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_PSR</name>
            <displayName>DSI_PSR</displayName>
            <description>DSI Host PHY status register </description>
            <addressOffset>0xb0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00001528</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PD</name>
                <description>PHY direction
This bit indicates the status of phydirection D-PHY signal.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PSSC</name>
                <description>PHY stop state clock lane
This bit indicates the status of phystopstateclklane D-PHY signal.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>UANC</name>
                <description>ULPS active not clock lane
This bit indicates the status of ulpsactivenotclklane D-PHY signal.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PSS0</name>
                <description>PHY stop state lane 0
This bit indicates the status of phystopstate0lane D-PHY signal.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>UAN0</name>
                <description>ULPS active not lane 1
This bit indicates the status of ulpsactivenot0lane D-PHY signal.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RUE0</name>
                <description>RX ULPS escape lane 0
This bit indicates the status of rxulpsesc0lane D-PHY signal.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PSS1</name>
                <description>PHY stop state lane 1
This bit indicates the status of phystopstate1lane D-PHY signal.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>UAN1</name>
                <description>ULPS active not lane 1
This bit indicates the status of ulpsactivenot1lane D-PHY signal.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_ISR0</name>
            <displayName>DSI_ISR0</displayName>
            <description>DSI Host interrupt and status register 0 </description>
            <addressOffset>0xbc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AE0</name>
                <description>Acknowledge error 0
This bit retrieves the SoT error from the acknowledge error report.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE1</name>
                <description>Acknowledge error 1
This bit retrieves the SoT sync error from the acknowledge error report.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE2</name>
                <description>Acknowledge error 2
This bit retrieves the EoT sync error from the acknowledge error report.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE3</name>
                <description>Acknowledge error 3
This bit retrieves the escape mode entry command error from the acknowledge error report.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE4</name>
                <description>Acknowledge error 4
This bit retrieves the LP transmit sync error from the acknowledge error report.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE5</name>
                <description>Acknowledge error 5
This bit retrieves the peripheral timeout error from the acknowledge error report.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE6</name>
                <description>Acknowledge error 6
This bit retrieves the false control error from the acknowledge error report.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE7</name>
                <description>Acknowledge error 7
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE8</name>
                <description>Acknowledge error 8
This bit retrieves the ECC error, single-bit (detected and corrected) from the acknowledge error report.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE9</name>
                <description>Acknowledge error 9
This bit retrieves the ECC error, multi-bit (detected, not corrected) from the acknowledge error report.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE10</name>
                <description>Acknowledge error 10
This bit retrieves the checksum error (long packet only) from the acknowledge error report.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE11</name>
                <description>Acknowledge error 11
This bit retrieves the not recognized DSI data type from the acknowledge error report.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE12</name>
                <description>Acknowledge error 12
This bit retrieves the DSI VC ID Invalid from the acknowledge error report.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE13</name>
                <description>Acknowledge error 13
This bit retrieves the invalid transmission length from the acknowledge error report.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE14</name>
                <description>Acknowledge error 14
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE15</name>
                <description>Acknowledge error 15
This bit retrieves the DSI protocol violation from the acknowledge error report.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE0</name>
                <description>PHY error 0
This bit indicates the ErrEsc escape entry error from lane 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE1</name>
                <description>PHY error 1
This bit indicates the ErrSyncEsc low-power transmission synchronization error from lane 0.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE2</name>
                <description>PHY error 2
This bit indicates the ErrControl error from lane 0.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE3</name>
                <description>PHY error 3
This bit indicates the LP0 contention error ErrContentionLP0 from lane 0.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE4</name>
                <description>PHY error 4
This bit indicates the LP1 contention error ErrContentionLP1 from lane 0.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
