knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>GFXMMU_LUT143L</name>
            <displayName>GFXMMU_LUT143L</displayName>
            <description>GFXMMU LUT entry 143 low</description>
            <addressOffset>0x1478</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT143H</name>
            <displayName>GFXMMU_LUT143H</displayName>
            <description>GFXMMU LUT entry 143 high</description>
            <addressOffset>0x147c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT144L</name>
            <displayName>GFXMMU_LUT144L</displayName>
            <description>GFXMMU LUT entry 144 low</description>
            <addressOffset>0x1480</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT144H</name>
            <displayName>GFXMMU_LUT144H</displayName>
            <description>GFXMMU LUT entry 144 high</description>
            <addressOffset>0x1484</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT145L</name>
            <displayName>GFXMMU_LUT145L</displayName>
            <description>GFXMMU LUT entry 145 low</description>
            <addressOffset>0x1488</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT145H</name>
            <displayName>GFXMMU_LUT145H</displayName>
            <description>GFXMMU LUT entry 145 high</description>
            <addressOffset>0x148c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT146L</name>
            <displayName>GFXMMU_LUT146L</displayName>
            <description>GFXMMU LUT entry 146 low</description>
            <addressOffset>0x1490</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT146H</name>
            <displayName>GFXMMU_LUT146H</displayName>
            <description>GFXMMU LUT entry 146 high</description>
            <addressOffset>0x1494</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT147L</name>
            <displayName>GFXMMU_LUT147L</displayName>
            <description>GFXMMU LUT entry 147 low</description>
            <addressOffset>0x1498</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT147H</name>
            <displayName>GFXMMU_LUT147H</displayName>
            <description>GFXMMU LUT entry 147 high</description>
            <addressOffset>0x149c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT148L</name>
            <displayName>GFXMMU_LUT148L</displayName>
            <description>GFXMMU LUT entry 148 low</description>
            <addressOffset>0x14a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT148H</name>
            <displayName>GFXMMU_LUT148H</displayName>
            <description>GFXMMU LUT entry 148 high</description>
            <addressOffset>0x14a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT149L</name>
            <displayName>GFXMMU_LUT149L</displayName>
            <description>GFXMMU LUT entry 149 low</description>
            <addressOffset>0x14a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT149H</name>
            <displayName>GFXMMU_LUT149H</displayName>
            <description>GFXMMU LUT entry 149 high</description>
            <addressOffset>0x14ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT150L</name>
            <displayName>GFXMMU_LUT150L</displayName>
            <description>GFXMMU LUT entry 150 low</description>
            <addressOffset>0x14b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT150H</name>
            <displayName>GFXMMU_LUT150H</displayName>
            <description>GFXMMU LUT entry 150 high</description>
            <addressOffset>0x14b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT151L</name>
            <displayName>GFXMMU_LUT151L</displayName>
            <description>GFXMMU LUT entry 151 low</description>
            <addressOffset>0x14b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable
Line enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Line is disabled (no MMU evaluation is performed)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Line is enabled (MMU evaluation is performed)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FVB</name>
                <description>First Valid Block
Number of the first valid block of line number x.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LVB</name>
                <description>Last Valid Block
Number of the last valid block of line number X.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GFXMMU_LUT151H</name>
            <displayName>GFXMMU_LUT151H</displayName>
            <description>GFXMMU LUT entry 151 high</description>
            <addressOffset>0x14bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO</name>
                <description>Line offset
Line offset of line number x (i.e. offset of block 0 of line x)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
