knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_HUFFMIN0_1</name>
            <displayName>JPEG_HUFFMIN0_1</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x154</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN0_2</name>
            <displayName>JPEG_HUFFMIN0_2</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x158</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN0_3</name>
            <displayName>JPEG_HUFFMIN0_3</displayName>
            <description>JPEG Huffman min 0 [alternate]</description>
            <addressOffset>0x15C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN1_0</name>
            <displayName>JPEG_HUFFMIN1_0</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x160</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN1_1</name>
            <displayName>JPEG_HUFFMIN1_1</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x164</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN1_2</name>
            <displayName>JPEG_HUFFMIN1_2</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x168</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN1_3</name>
            <displayName>JPEG_HUFFMIN1_3</displayName>
            <description>JPEG Huffman min 1 [alternate]</description>
            <addressOffset>0x16C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN2_0</name>
            <displayName>JPEG_HUFFMIN2_0</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x170</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN2_1</name>
            <displayName>JPEG_HUFFMIN2_1</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x174</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN2_2</name>
            <displayName>JPEG_HUFFMIN2_2</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN2_3</name>
            <displayName>JPEG_HUFFMIN2_3</displayName>
            <description>JPEG Huffman min 2 [alternate]</description>
            <addressOffset>0x17C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN3_0</name>
            <displayName>JPEG_HUFFMIN3_0</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA3</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN3_1</name>
            <displayName>JPEG_HUFFMIN3_1</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA3</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN3_2</name>
            <displayName>JPEG_HUFFMIN3_2</displayName>
            <description>JPEG Huffman min</description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA3</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFMIN3_3</name>
            <displayName>JPEG_HUFFMIN3_3</displayName>
            <description>JPEG Huffman min 3 [alternate]</description>
            <addressOffset>0x18C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA3</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE0</name>
            <displayName>JPEG_HUFFBASE0</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Data 0
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA1</name>
                <description>Data 1
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE1</name>
            <displayName>JPEG_HUFFBASE1</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Data 2
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA3</name>
                <description>Data 3
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE2</name>
            <displayName>JPEG_HUFFBASE2</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x198</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA4</name>
                <description>Data 4
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA5</name>
                <description>Data 5
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE3</name>
            <displayName>JPEG_HUFFBASE3</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x19C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA6</name>
                <description>Data 6
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA7</name>
                <description>Data 7
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE4</name>
            <displayName>JPEG_HUFFBASE4</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1A0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA8</name>
                <description>Data 8
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA9</name>
                <description>Data 9
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE5</name>
            <displayName>JPEG_HUFFBASE5</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1A4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA10</name>
                <description>Data 10
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA11</name>
                <description>Data 11
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE6</name>
            <displayName>JPEG_HUFFBASE6</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1A8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA12</name>
                <description>Data 12
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA13</name>
                <description>Data 13
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE7</name>
            <displayName>JPEG_HUFFBASE7</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1AC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA14</name>
                <description>Data 14
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA15</name>
                <description>Data 15
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE8</name>
            <displayName>JPEG_HUFFBASE8</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1B0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA16</name>
                <description>Data 16
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA17</name>
                <description>Data 17
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE9</name>
            <displayName>JPEG_HUFFBASE9</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1B4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA18</name>
                <description>Data 18
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA19</name>
                <description>Data 19
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE10</name>
            <displayName>JPEG_HUFFBASE10</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1B8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA20</name>
                <description>Data 20
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA21</name>
                <description>Data 21
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE11</name>
            <displayName>JPEG_HUFFBASE11</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA22</name>
                <description>Data 22
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA23</name>
                <description>Data 23
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFBASE12</name>
            <displayName>JPEG_HUFFBASE12</displayName>
            <description>JPEG Huffman base</description>
            <addressOffset>0x1C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA24</name>
                <description>Data 24
Base Huffman value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA25</name>
                <description>Data 25
Base Huffman value.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
