knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_DHTMEM22</name>
            <displayName>JPEG_DHTMEM22</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3B8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA88</name>
                <description>Huffman table data 88
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA89</name>
                <description>Huffman table data 89
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA90</name>
                <description>Huffman table data 90
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA91</name>
                <description>Huffman table data 91
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM23</name>
            <displayName>JPEG_DHTMEM23</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA92</name>
                <description>Huffman table data 92
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA93</name>
                <description>Huffman table data 93
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA94</name>
                <description>Huffman table data 94
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA95</name>
                <description>Huffman table data 95
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM24</name>
            <displayName>JPEG_DHTMEM24</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA96</name>
                <description>Huffman table data 96
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA97</name>
                <description>Huffman table data 97
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA98</name>
                <description>Huffman table data 98
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA99</name>
                <description>Huffman table data 99
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM25</name>
            <displayName>JPEG_DHTMEM25</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3C4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA100</name>
                <description>Huffman table data 100
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA101</name>
                <description>Huffman table data 101
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA102</name>
                <description>Huffman table data 102
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA103</name>
                <description>Huffman table data 103
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM26</name>
            <displayName>JPEG_DHTMEM26</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3C8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA104</name>
                <description>Huffman table data 104
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA105</name>
                <description>Huffman table data 105
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA106</name>
                <description>Huffman table data 106
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA107</name>
                <description>Huffman table data 107
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM27</name>
            <displayName>JPEG_DHTMEM27</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3CC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA108</name>
                <description>Huffman table data 108
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA109</name>
                <description>Huffman table data 109
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA110</name>
                <description>Huffman table data 110
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA111</name>
                <description>Huffman table data 111
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM28</name>
            <displayName>JPEG_DHTMEM28</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3D0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA112</name>
                <description>Huffman table data 112
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA113</name>
                <description>Huffman table data 113
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA114</name>
                <description>Huffman table data 114
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA115</name>
                <description>Huffman table data 115
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM29</name>
            <displayName>JPEG_DHTMEM29</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3D4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA116</name>
                <description>Huffman table data 116
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA117</name>
                <description>Huffman table data 117
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA118</name>
                <description>Huffman table data 118
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA119</name>
                <description>Huffman table data 119
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM30</name>
            <displayName>JPEG_DHTMEM30</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3D8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA120</name>
                <description>Huffman table data 120
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA121</name>
                <description>Huffman table data 121
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA122</name>
                <description>Huffman table data 122
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA123</name>
                <description>Huffman table data 123
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM31</name>
            <displayName>JPEG_DHTMEM31</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3DC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA124</name>
                <description>Huffman table data 124
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA125</name>
                <description>Huffman table data 125
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA126</name>
                <description>Huffman table data 126
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA127</name>
                <description>Huffman table data 127
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM32</name>
            <displayName>JPEG_DHTMEM32</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3E0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA128</name>
                <description>Huffman table data 128
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA129</name>
                <description>Huffman table data 129
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA130</name>
                <description>Huffman table data 130
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA131</name>
                <description>Huffman table data 131
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM33</name>
            <displayName>JPEG_DHTMEM33</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3E4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA132</name>
                <description>Huffman table data 132
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA133</name>
                <description>Huffman table data 133
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA134</name>
                <description>Huffman table data 134
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA135</name>
                <description>Huffman table data 135
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM34</name>
            <displayName>JPEG_DHTMEM34</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3E8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA136</name>
                <description>Huffman table data 136
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA137</name>
                <description>Huffman table data 137
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA138</name>
                <description>Huffman table data 138
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA139</name>
                <description>Huffman table data 139
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM35</name>
            <displayName>JPEG_DHTMEM35</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA140</name>
                <description>Huffman table data 140
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA141</name>
                <description>Huffman table data 141
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA142</name>
                <description>Huffman table data 142
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA143</name>
                <description>Huffman table data 143
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
