knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_DHTMEM36</name>
            <displayName>JPEG_DHTMEM36</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA144</name>
                <description>Huffman table data 144
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA145</name>
                <description>Huffman table data 145
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA146</name>
                <description>Huffman table data 146
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA147</name>
                <description>Huffman table data 147
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM37</name>
            <displayName>JPEG_DHTMEM37</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3F4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA148</name>
                <description>Huffman table data 148
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA149</name>
                <description>Huffman table data 149
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA150</name>
                <description>Huffman table data 150
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA151</name>
                <description>Huffman table data 151
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM38</name>
            <displayName>JPEG_DHTMEM38</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA152</name>
                <description>Huffman table data 152
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA153</name>
                <description>Huffman table data 153
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA154</name>
                <description>Huffman table data 154
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA155</name>
                <description>Huffman table data 155
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM39</name>
            <displayName>JPEG_DHTMEM39</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x3FC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA156</name>
                <description>Huffman table data 156
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA157</name>
                <description>Huffman table data 157
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA158</name>
                <description>Huffman table data 158
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA159</name>
                <description>Huffman table data 159
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM40</name>
            <displayName>JPEG_DHTMEM40</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x400</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA160</name>
                <description>Huffman table data 160
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA161</name>
                <description>Huffman table data 161
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA162</name>
                <description>Huffman table data 162
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA163</name>
                <description>Huffman table data 163
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM41</name>
            <displayName>JPEG_DHTMEM41</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x404</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA164</name>
                <description>Huffman table data 164
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA165</name>
                <description>Huffman table data 165
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA166</name>
                <description>Huffman table data 166
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA167</name>
                <description>Huffman table data 167
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM42</name>
            <displayName>JPEG_DHTMEM42</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x408</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA168</name>
                <description>Huffman table data 168
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA169</name>
                <description>Huffman table data 169
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA170</name>
                <description>Huffman table data 170
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA171</name>
                <description>Huffman table data 171
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM43</name>
            <displayName>JPEG_DHTMEM43</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x40C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA172</name>
                <description>Huffman table data 172
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA173</name>
                <description>Huffman table data 173
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA174</name>
                <description>Huffman table data 174
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA175</name>
                <description>Huffman table data 175
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM44</name>
            <displayName>JPEG_DHTMEM44</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x410</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA176</name>
                <description>Huffman table data 176
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA177</name>
                <description>Huffman table data 177
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA178</name>
                <description>Huffman table data 178
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA179</name>
                <description>Huffman table data 179
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM45</name>
            <displayName>JPEG_DHTMEM45</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x414</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA180</name>
                <description>Huffman table data 180
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA181</name>
                <description>Huffman table data 181
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA182</name>
                <description>Huffman table data 182
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA183</name>
                <description>Huffman table data 183
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM46</name>
            <displayName>JPEG_DHTMEM46</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x418</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA184</name>
                <description>Huffman table data 184
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA185</name>
                <description>Huffman table data 185
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA186</name>
                <description>Huffman table data 186
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA187</name>
                <description>Huffman table data 187
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM47</name>
            <displayName>JPEG_DHTMEM47</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x41C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA188</name>
                <description>Huffman table data 188
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA189</name>
                <description>Huffman table data 189
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA190</name>
                <description>Huffman table data 190
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA191</name>
                <description>Huffman table data 191
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM48</name>
            <displayName>JPEG_DHTMEM48</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x420</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA192</name>
                <description>Huffman table data 192
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA193</name>
                <description>Huffman table data 193
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA194</name>
                <description>Huffman table data 194
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA195</name>
                <description>Huffman table data 195
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM49</name>
            <displayName>JPEG_DHTMEM49</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x424</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA196</name>
                <description>Huffman table data 196
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA197</name>
                <description>Huffman table data 197
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA198</name>
                <description>Huffman table data 198
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA199</name>
                <description>Huffman table data 199
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
