knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_DHTMEM50</name>
            <displayName>JPEG_DHTMEM50</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x428</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA200</name>
                <description>Huffman table data 200
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA201</name>
                <description>Huffman table data 201
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA202</name>
                <description>Huffman table data 202
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA203</name>
                <description>Huffman table data 203
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM51</name>
            <displayName>JPEG_DHTMEM51</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x42C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA204</name>
                <description>Huffman table data 204
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA205</name>
                <description>Huffman table data 205
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA206</name>
                <description>Huffman table data 206
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA207</name>
                <description>Huffman table data 207
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM52</name>
            <displayName>JPEG_DHTMEM52</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x430</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA208</name>
                <description>Huffman table data 208
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA209</name>
                <description>Huffman table data 209
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA210</name>
                <description>Huffman table data 210
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA211</name>
                <description>Huffman table data 211
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM53</name>
            <displayName>JPEG_DHTMEM53</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x434</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA212</name>
                <description>Huffman table data 212
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA213</name>
                <description>Huffman table data 213
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA214</name>
                <description>Huffman table data 214
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA215</name>
                <description>Huffman table data 215
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM54</name>
            <displayName>JPEG_DHTMEM54</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x438</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA216</name>
                <description>Huffman table data 216
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA217</name>
                <description>Huffman table data 217
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA218</name>
                <description>Huffman table data 218
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA219</name>
                <description>Huffman table data 219
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM55</name>
            <displayName>JPEG_DHTMEM55</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x43C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA220</name>
                <description>Huffman table data 220
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA221</name>
                <description>Huffman table data 221
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA222</name>
                <description>Huffman table data 222
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA223</name>
                <description>Huffman table data 223
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM56</name>
            <displayName>JPEG_DHTMEM56</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x440</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA224</name>
                <description>Huffman table data 224
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA225</name>
                <description>Huffman table data 225
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA226</name>
                <description>Huffman table data 226
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA227</name>
                <description>Huffman table data 227
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM57</name>
            <displayName>JPEG_DHTMEM57</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x444</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA228</name>
                <description>Huffman table data 228
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA229</name>
                <description>Huffman table data 229
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA230</name>
                <description>Huffman table data 230
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA231</name>
                <description>Huffman table data 231
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM58</name>
            <displayName>JPEG_DHTMEM58</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x448</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA232</name>
                <description>Huffman table data 232
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA233</name>
                <description>Huffman table data 233
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA234</name>
                <description>Huffman table data 234
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA235</name>
                <description>Huffman table data 235
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM59</name>
            <displayName>JPEG_DHTMEM59</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x44C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA236</name>
                <description>Huffman table data 236
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA237</name>
                <description>Huffman table data 237
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA238</name>
                <description>Huffman table data 238
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA239</name>
                <description>Huffman table data 239
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM60</name>
            <displayName>JPEG_DHTMEM60</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x450</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA240</name>
                <description>Huffman table data 240
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA241</name>
                <description>Huffman table data 241
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA242</name>
                <description>Huffman table data 242
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA243</name>
                <description>Huffman table data 243
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM61</name>
            <displayName>JPEG_DHTMEM61</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x454</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA244</name>
                <description>Huffman table data 244
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA245</name>
                <description>Huffman table data 245
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA246</name>
                <description>Huffman table data 246
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA247</name>
                <description>Huffman table data 247
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM62</name>
            <displayName>JPEG_DHTMEM62</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x458</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA248</name>
                <description>Huffman table data 248
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA249</name>
                <description>Huffman table data 249
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA250</name>
                <description>Huffman table data 250
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA251</name>
                <description>Huffman table data 251
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM63</name>
            <displayName>JPEG_DHTMEM63</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x45C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA252</name>
                <description>Huffman table data 252
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA253</name>
                <description>Huffman table data 253
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA254</name>
                <description>Huffman table data 254
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA255</name>
                <description>Huffman table data 255
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
