knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_DHTMEM64</name>
            <displayName>JPEG_DHTMEM64</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x460</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA256</name>
                <description>Huffman table data 256
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA257</name>
                <description>Huffman table data 257
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA258</name>
                <description>Huffman table data 258
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA259</name>
                <description>Huffman table data 259
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM65</name>
            <displayName>JPEG_DHTMEM65</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x464</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA260</name>
                <description>Huffman table data 260
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA261</name>
                <description>Huffman table data 261
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA262</name>
                <description>Huffman table data 262
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA263</name>
                <description>Huffman table data 263
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM66</name>
            <displayName>JPEG_DHTMEM66</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x468</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA264</name>
                <description>Huffman table data 264
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA265</name>
                <description>Huffman table data 265
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA266</name>
                <description>Huffman table data 266
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA267</name>
                <description>Huffman table data 267
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM67</name>
            <displayName>JPEG_DHTMEM67</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x46C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA268</name>
                <description>Huffman table data 268
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA269</name>
                <description>Huffman table data 269
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA270</name>
                <description>Huffman table data 270
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA271</name>
                <description>Huffman table data 271
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM68</name>
            <displayName>JPEG_DHTMEM68</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x470</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA272</name>
                <description>Huffman table data 272
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA273</name>
                <description>Huffman table data 273
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA274</name>
                <description>Huffman table data 274
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA275</name>
                <description>Huffman table data 275
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM69</name>
            <displayName>JPEG_DHTMEM69</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x474</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA276</name>
                <description>Huffman table data 276
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA277</name>
                <description>Huffman table data 277
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA278</name>
                <description>Huffman table data 278
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA279</name>
                <description>Huffman table data 279
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM70</name>
            <displayName>JPEG_DHTMEM70</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x478</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA280</name>
                <description>Huffman table data 280
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA281</name>
                <description>Huffman table data 281
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA282</name>
                <description>Huffman table data 282
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA283</name>
                <description>Huffman table data 283
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM71</name>
            <displayName>JPEG_DHTMEM71</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x47C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA284</name>
                <description>Huffman table data 284
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA285</name>
                <description>Huffman table data 285
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA286</name>
                <description>Huffman table data 286
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA287</name>
                <description>Huffman table data 287
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM72</name>
            <displayName>JPEG_DHTMEM72</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x480</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA288</name>
                <description>Huffman table data 288
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA289</name>
                <description>Huffman table data 289
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA290</name>
                <description>Huffman table data 290
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA291</name>
                <description>Huffman table data 291
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM73</name>
            <displayName>JPEG_DHTMEM73</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x484</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA292</name>
                <description>Huffman table data 292
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA293</name>
                <description>Huffman table data 293
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA294</name>
                <description>Huffman table data 294
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA295</name>
                <description>Huffman table data 295
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM74</name>
            <displayName>JPEG_DHTMEM74</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x488</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA296</name>
                <description>Huffman table data 296
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA297</name>
                <description>Huffman table data 297
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA298</name>
                <description>Huffman table data 298
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA299</name>
                <description>Huffman table data 299
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM75</name>
            <displayName>JPEG_DHTMEM75</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x48C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA300</name>
                <description>Huffman table data 300
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA301</name>
                <description>Huffman table data 301
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA302</name>
                <description>Huffman table data 302
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA303</name>
                <description>Huffman table data 303
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM76</name>
            <displayName>JPEG_DHTMEM76</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x490</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA304</name>
                <description>Huffman table data 304
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA305</name>
                <description>Huffman table data 305
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA306</name>
                <description>Huffman table data 306
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA307</name>
                <description>Huffman table data 307
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM77</name>
            <displayName>JPEG_DHTMEM77</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x494</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA308</name>
                <description>Huffman table data 308
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA309</name>
                <description>Huffman table data 309
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA310</name>
                <description>Huffman table data 310
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA311</name>
                <description>Huffman table data 311
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
