knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_DHTMEM78</name>
            <displayName>JPEG_DHTMEM78</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x498</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA312</name>
                <description>Huffman table data 312
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA313</name>
                <description>Huffman table data 313
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA314</name>
                <description>Huffman table data 314
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA315</name>
                <description>Huffman table data 315
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM79</name>
            <displayName>JPEG_DHTMEM79</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x49C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA316</name>
                <description>Huffman table data 316
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA317</name>
                <description>Huffman table data 317
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA318</name>
                <description>Huffman table data 318
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA319</name>
                <description>Huffman table data 319
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM80</name>
            <displayName>JPEG_DHTMEM80</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4A0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA320</name>
                <description>Huffman table data 320
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA321</name>
                <description>Huffman table data 321
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA322</name>
                <description>Huffman table data 322
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA323</name>
                <description>Huffman table data 323
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM81</name>
            <displayName>JPEG_DHTMEM81</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4A4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA324</name>
                <description>Huffman table data 324
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA325</name>
                <description>Huffman table data 325
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA326</name>
                <description>Huffman table data 326
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA327</name>
                <description>Huffman table data 327
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM82</name>
            <displayName>JPEG_DHTMEM82</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4A8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA328</name>
                <description>Huffman table data 328
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA329</name>
                <description>Huffman table data 329
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA330</name>
                <description>Huffman table data 330
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA331</name>
                <description>Huffman table data 331
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM83</name>
            <displayName>JPEG_DHTMEM83</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4AC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA332</name>
                <description>Huffman table data 332
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA333</name>
                <description>Huffman table data 333
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA334</name>
                <description>Huffman table data 334
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA335</name>
                <description>Huffman table data 335
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM84</name>
            <displayName>JPEG_DHTMEM84</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4B0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA336</name>
                <description>Huffman table data 336
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA337</name>
                <description>Huffman table data 337
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA338</name>
                <description>Huffman table data 338
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA339</name>
                <description>Huffman table data 339
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM85</name>
            <displayName>JPEG_DHTMEM85</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4B4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA340</name>
                <description>Huffman table data 340
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA341</name>
                <description>Huffman table data 341
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA342</name>
                <description>Huffman table data 342
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA343</name>
                <description>Huffman table data 343
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM86</name>
            <displayName>JPEG_DHTMEM86</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4B8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA344</name>
                <description>Huffman table data 344
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA345</name>
                <description>Huffman table data 345
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA346</name>
                <description>Huffman table data 346
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA347</name>
                <description>Huffman table data 347
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM87</name>
            <displayName>JPEG_DHTMEM87</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA348</name>
                <description>Huffman table data 348
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA349</name>
                <description>Huffman table data 349
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA350</name>
                <description>Huffman table data 350
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA351</name>
                <description>Huffman table data 351
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM88</name>
            <displayName>JPEG_DHTMEM88</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA352</name>
                <description>Huffman table data 352
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA353</name>
                <description>Huffman table data 353
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA354</name>
                <description>Huffman table data 354
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA355</name>
                <description>Huffman table data 355
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM89</name>
            <displayName>JPEG_DHTMEM89</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4C4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA356</name>
                <description>Huffman table data 356
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA357</name>
                <description>Huffman table data 357
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA358</name>
                <description>Huffman table data 358
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA359</name>
                <description>Huffman table data 359
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM90</name>
            <displayName>JPEG_DHTMEM90</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4C8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA360</name>
                <description>Huffman table data 360
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA361</name>
                <description>Huffman table data 361
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA362</name>
                <description>Huffman table data 362
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA363</name>
                <description>Huffman table data 363
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_DHTMEM91</name>
            <displayName>JPEG_DHTMEM91</displayName>
            <description>JPEG DHT memory</description>
            <addressOffset>0x4CC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA364</name>
                <description>Huffman table data 364
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA365</name>
                <description>Huffman table data 365
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA366</name>
                <description>Huffman table data 366
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA367</name>
                <description>Huffman table data 367
Huffman table data for DHT marker segment generation.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
