knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_HUFFENC_AC0_28</name>
            <displayName>JPEG_HUFFENC_AC0_28</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x570</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE56</name>
                <description>Huffman code 56
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN56</name>
                <description>Huffman length 56
Number of bits in the Huffman code HCODE56 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE57</name>
                <description>Huffman code 57
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN57</name>
                <description>Huffman length 57
Number of bits in the Huffman code HCODE57 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_29</name>
            <displayName>JPEG_HUFFENC_AC0_29</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x574</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE58</name>
                <description>Huffman code 58
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN58</name>
                <description>Huffman length 58
Number of bits in the Huffman code HCODE58 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE59</name>
                <description>Huffman code 59
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN59</name>
                <description>Huffman length 59
Number of bits in the Huffman code HCODE59 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_30</name>
            <displayName>JPEG_HUFFENC_AC0_30</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x578</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE60</name>
                <description>Huffman code 60
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN60</name>
                <description>Huffman length 60
Number of bits in the Huffman code HCODE60 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE61</name>
                <description>Huffman code 61
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN61</name>
                <description>Huffman length 61
Number of bits in the Huffman code HCODE61 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_31</name>
            <displayName>JPEG_HUFFENC_AC0_31</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x57C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE62</name>
                <description>Huffman code 62
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN62</name>
                <description>Huffman length 62
Number of bits in the Huffman code HCODE62 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE63</name>
                <description>Huffman code 63
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN63</name>
                <description>Huffman length 63
Number of bits in the Huffman code HCODE63 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_32</name>
            <displayName>JPEG_HUFFENC_AC0_32</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x580</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE64</name>
                <description>Huffman code 64
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN64</name>
                <description>Huffman length 64
Number of bits in the Huffman code HCODE64 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE65</name>
                <description>Huffman code 65
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN65</name>
                <description>Huffman length 65
Number of bits in the Huffman code HCODE65 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_33</name>
            <displayName>JPEG_HUFFENC_AC0_33</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x584</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE66</name>
                <description>Huffman code 66
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN66</name>
                <description>Huffman length 66
Number of bits in the Huffman code HCODE66 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE67</name>
                <description>Huffman code 67
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN67</name>
                <description>Huffman length 67
Number of bits in the Huffman code HCODE67 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_34</name>
            <displayName>JPEG_HUFFENC_AC0_34</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x588</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE68</name>
                <description>Huffman code 68
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN68</name>
                <description>Huffman length 68
Number of bits in the Huffman code HCODE68 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE69</name>
                <description>Huffman code 69
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN69</name>
                <description>Huffman length 69
Number of bits in the Huffman code HCODE69 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_35</name>
            <displayName>JPEG_HUFFENC_AC0_35</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x58C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE70</name>
                <description>Huffman code 70
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN70</name>
                <description>Huffman length 70
Number of bits in the Huffman code HCODE70 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE71</name>
                <description>Huffman code 71
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN71</name>
                <description>Huffman length 71
Number of bits in the Huffman code HCODE71 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_36</name>
            <displayName>JPEG_HUFFENC_AC0_36</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x590</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE72</name>
                <description>Huffman code 72
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN72</name>
                <description>Huffman length 72
Number of bits in the Huffman code HCODE72 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE73</name>
                <description>Huffman code 73
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN73</name>
                <description>Huffman length 73
Number of bits in the Huffman code HCODE73 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_37</name>
            <displayName>JPEG_HUFFENC_AC0_37</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x594</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE74</name>
                <description>Huffman code 74
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN74</name>
                <description>Huffman length 74
Number of bits in the Huffman code HCODE74 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE75</name>
                <description>Huffman code 75
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN75</name>
                <description>Huffman length 75
Number of bits in the Huffman code HCODE75 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_38</name>
            <displayName>JPEG_HUFFENC_AC0_38</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x598</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE76</name>
                <description>Huffman code 76
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN76</name>
                <description>Huffman length 76
Number of bits in the Huffman code HCODE76 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE77</name>
                <description>Huffman code 77
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN77</name>
                <description>Huffman length 77
Number of bits in the Huffman code HCODE77 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_39</name>
            <displayName>JPEG_HUFFENC_AC0_39</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x59C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE78</name>
                <description>Huffman code 78
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN78</name>
                <description>Huffman length 78
Number of bits in the Huffman code HCODE78 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE79</name>
                <description>Huffman code 79
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN79</name>
                <description>Huffman length 79
Number of bits in the Huffman code HCODE79 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_40</name>
            <displayName>JPEG_HUFFENC_AC0_40</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5A0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE80</name>
                <description>Huffman code 80
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN80</name>
                <description>Huffman length 80
Number of bits in the Huffman code HCODE80 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE81</name>
                <description>Huffman code 81
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN81</name>
                <description>Huffman length 81
Number of bits in the Huffman code HCODE81 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
