knieriem/tinygo-stm32-svd/svd/stm32u5fx.svd
          <register>
            <name>JPEG_HUFFENC_AC0_54</name>
            <displayName>JPEG_HUFFENC_AC0_54</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5D8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE108</name>
                <description>Huffman code 108
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN108</name>
                <description>Huffman length 108
Number of bits in the Huffman code HCODE108 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE109</name>
                <description>Huffman code 109
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN109</name>
                <description>Huffman length 109
Number of bits in the Huffman code HCODE109 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_55</name>
            <displayName>JPEG_HUFFENC_AC0_55</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5DC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE110</name>
                <description>Huffman code 110
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN110</name>
                <description>Huffman length 110
Number of bits in the Huffman code HCODE110 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE111</name>
                <description>Huffman code 111
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN111</name>
                <description>Huffman length 111
Number of bits in the Huffman code HCODE111 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_0</name>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     
            <displayName>JPEG_HUFFENC_AC1_0</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_55</alternateRegister>
            <addressOffset>0x5DC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE0</name>
                <description>Huffman code 0
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN0</name>
                <description>Huffman length 0
Number of bits in the Huffman code HCODE0 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE1</name>
                <description>Huffman code 1
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN1</name>
                <description>Huffman length 1
Number of bits in the Huffman code HCODE1 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_56</name>
            <displayName>JPEG_HUFFENC_AC0_56</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5E0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE112</name>
                <description>Huffman code 112
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN112</name>
                <description>Huffman length 112
Number of bits in the Huffman code HCODE112 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE113</name>
                <description>Huffman code 113
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN113</name>
                <description>Huffman length 113
Number of bits in the Huffman code HCODE113 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_1</name>
            <displayName>JPEG_HUFFENC_AC1_1</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_56</alternateRegister>
            <addressOffset>0x5E0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE2</name>
                <description>Huffman code 2
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN2</name>
                <description>Huffman length 2
Number of bits in the Huffman code HCODE2 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE3</name>
                <description>Huffman code 3
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN3</name>
                <description>Huffman length 3
Number of bits in the Huffman code HCODE3 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_57</name>
            <displayName>JPEG_HUFFENC_AC0_57</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5E4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE114</name>
                <description>Huffman code 114
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN114</name>
                <description>Huffman length 114
Number of bits in the Huffman code HCODE114 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE115</name>
                <description>Huffman code 115
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN115</name>
                <description>Huffman length 115
Number of bits in the Huffman code HCODE115 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_2</name>
            <displayName>JPEG_HUFFENC_AC1_2</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_57</alternateRegister>
            <addressOffset>0x5E4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE4</name>
                <description>Huffman code 4
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN4</name>
                <description>Huffman length 4
Number of bits in the Huffman code HCODE4 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE5</name>
                <description>Huffman code 5
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN5</name>
                <description>Huffman length 5
Number of bits in the Huffman code HCODE5 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_58</name>
            <displayName>JPEG_HUFFENC_AC0_58</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5E8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE116</name>
                <description>Huffman code 116
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN116</name>
                <description>Huffman length 116
Number of bits in the Huffman code HCODE116 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE117</name>
                <description>Huffman code 117
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN117</name>
                <description>Huffman length 117
Number of bits in the Huffman code HCODE117 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_3</name>
            <displayName>JPEG_HUFFENC_AC1_3</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_58</alternateRegister>
            <addressOffset>0x5E8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE6</name>
                <description>Huffman code 6
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN6</name>
                <description>Huffman length 6
Number of bits in the Huffman code HCODE6 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE7</name>
                <description>Huffman code 7
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN7</name>
                <description>Huffman length 7
Number of bits in the Huffman code HCODE7 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_59</name>
            <displayName>JPEG_HUFFENC_AC0_59</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE118</name>
                <description>Huffman code 118
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN118</name>
                <description>Huffman length 118
Number of bits in the Huffman code HCODE118 minus 1.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE119</name>
                <description>Huffman code 119
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN119</name>
                <description>Huffman length 119
Number of bits in the Huffman code HCODE119 minus 1.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
